#!/usr/bin/env node

/*
Продумать, где можно применить замыкания для практикума из седьмого урока.
*/

// Замыкание — это комбинация функции и лексического окружения, в котором эта функция была объявлена. Это окружение
// состоит из произвольного количества локальных переменных, которые были в области действия функции во время создания
// замыкания. Надо продумать, где может случится конфликт при разработке, чтобы создать защищенную переменную. Также можно
// создать функцию, которое будет изменять свое состояние. В том числе замыкание может помочь нам не потерять переданные
// данные при создании обработчика. Может помочь нам защитить данные(инкапсуляция).

